Autodesk.Revit.DB.Plumbing.PipingSystem.CanBeHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
Checks if the element can be used as a hydraulic loop boundary.
element:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.IsHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
Checks if the element is a valid hydraulic loop boundary.
element:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.DeleteHydraulicSeparation(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Deletes hydraulically separated systems and merges the system components into the connected system.
document:
The document where the system is deleted.
pipeElementIds:
The boundary pipe that separates the system. Multiple pipes are allowed to delete more than one separated systems.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements is not a pipe.
-or-
One or more elements is not a valid loop boundary.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.CreateHydraulicSeparation(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Creates new system which is hydraulically separated from the existing system.
Remarks:
Hydraulically separated systems allow independent flow and pressure analysis for each hydraulic loop.
For example, each hydraulic loop has its own cirtical path. The calculated pressure drop on the primary
pump is consisted of all pressure drop on the primary critical path. Any pressure drop on the secondary
loop would only contribute to the calculated pressure drop of the secondary pump.
document:
The document where the new system is created.
pipeElementIds:
The boundary pipe that defines a new system. Multiple pipes are allowed to create more than one separated systems.
Returns:
The newly created piping system elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements is not a pipe.
-or-
One or more elements is already the loop boundary.
-or-
One or more elements can not be used as loop boundary. Check if the element connects to any junction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
name:
The name of the piping system to be created.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011